mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
typedef struct stc_exti_nmirr_field
{
        __IO  uint16_t  NR                       :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_exti_nmirr_field_t;

typedef struct stc_exti_nmicl_field
{
        __IO  uint16_t  NCL                      :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_exti_nmicl_field_t;

typedef struct stc_exti_elvr2_field
{
        __IO  uint32_t  LC0                      :1;
        __IO  uint32_t  LC1                      :1;
        __IO  uint32_t  LC2                      :1;
        __IO  uint32_t  LC3                      :1;
        __IO  uint32_t  LC4                      :1;
        __IO  uint32_t  LC5                      :1;
        __IO  uint32_t  LC6                      :1;
        __IO  uint32_t  LC7                      :1;
        __IO  uint32_t  LC8                      :1;
        __IO  uint32_t  LC9                      :1;
        __IO  uint32_t  LC10                     :1;
        __IO  uint32_t  LC11                     :1;
        __IO  uint32_t  LC12                     :1;
        __IO  uint32_t  LC13                     :1;
        __IO  uint32_t  LC14                     :1;
        __IO  uint32_t  LC15                     :1;
        __IO  uint32_t  LC16                     :1;
        __IO  uint32_t  LC17                     :1;
        __IO  uint32_t  LC18                     :1;
        __IO  uint32_t  LC19                     :1;
        __IO  uint32_t  LC20                     :1;
        __IO  uint32_t  LC21                     :1;
        __IO  uint32_t  LC22                     :1;
        __IO  uint32_t  LC23                     :1;
        __IO  uint32_t  LC24                     :1;
        __IO  uint32_t  LC25                     :1;
        __IO  uint32_t  LC26                     :1;
        __IO  uint32_t  LC27                     :1;
        __IO  uint32_t  LC28                     :1;
        __IO  uint32_t  LC29                     :1;
        __IO  uint32_t  LC30                     :1;
        __IO  uint32_t  LC31                     :1;
} stc_exti_elvr2_field_t;

/*******************************************************************************
* FLASH_IF_MODULE
*******************************************************************************/
typedef struct stc_flash_if_faszr_field
{
    union {
        struct {
            __IO  uint32_t  ASZ                  :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  ASZ0                 :1;
            __IO  uint32_t  ASZ1                 :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_flash_if_faszr_field_t;

typedef struct stc_flash_if_frwtr_field
{
    union {
        struct {
            __IO  uint32_t  RWT                  :2;
            __IO  uint32_t  RESERVED0            :30;
        };
        struct {
            __IO  uint32_t  RWT0                 :1;
            __IO  uint32_t  RWT1                 :1;
            __IO  uint32_t  RESERVED1            :30;
        };
    };
} stc_flash_if_frwtr_field_t;

typedef struct stc_flash_if_fstr_field
{
        __IO  uint32_t  RDY                      :1;
        __IO  uint32_t  HNG                      :1;
        __IO  uint32_t  ERR                      :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_flash_if_fstr_field_t;

typedef struct stc_flash_if_fsyndn_field
{
    union {
        struct {
            __IO  uint32_t  SD                   :3;
            __IO  uint32_t  RESERVED0            :29;
        };
        struct {
            __IO  uint32_t  SD0                  :1;
            __IO  uint32_t  SD1                  :1;
            __IO  uint32_t  SD2                  :1;
            __IO  uint32_t  RESERVED1            :29;
        };
    };
} stc_flash_if_fsyndn_field_t;

typedef struct stc_flash_if_fbfcr_field
{
        __IO  uint32_t  BE                       :1;
        __IO  uint32_t  BS                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_flash_if_fbfcr_field_t;

typedef struct stc_flash_if_ficr_field
{
        __IO  uint32_t  RDYIE                    :1;
        __IO  uint32_t  HNGIE                    :1;
        __IO  uint32_t  ERRIE                    :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_flash_if_ficr_field_t;

typedef struct stc_flash_if_fisr_field
{
        __IO  uint32_t  RDYIF                    :1;
        __IO  uint32_t  HNGIF                    :1;
        __IO  uint32_t  ERRIF                    :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_flash_if_fisr_field_t;

typedef struct stc_flash_if_ficlr_field
{
        __IO  uint32_t  RDYIC                    :1;
        __IO  uint32_t  HNGIC                    :1;
        __IO  uint32_t  ERRIC                    :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_flash_if_ficlr_field_t;

typedef struct stc_flash_if_crtrmm_field
{
    union {
        struct {
            __IO  uint32_t  TRMM                 :10;
            __IO  uint32_t  RESERVED0            :6;
            __IO  uint32_t  TTRMM                :5;
            __IO  uint32_t  RESERVED2            :11;
        };
        struct {
            __IO  uint32_t  TRMM0                :1;
            __IO  uint32_t  TRMM1                :1;
            __IO  uint32_t  TRMM2                :1;
            __IO  uint32_t  TRMM3                :1;
            __IO  uint32_t  TRMM4                :1;
            __IO  uint32_t  TRMM5                :1;
            __IO  uint32_t  TRMM6                :1;
            __IO  uint32_t  TRMM7                :1;
            __IO  uint32_t  TRMM8                :1;
            __IO  uint32_t  TRMM9                :1;
            __IO  uint32_t  RESERVED1            :6;
            __IO  uint32_t  TTRMM0               :1;
            __IO  uint32_t  TTRMM1               :1;
            __IO  uint32_t  TTRMM2               :1;
            __IO  uint32_t  TTRMM3               :1;
            __IO  uint32_t  TTRMM4               :1;
            __IO  uint32_t  RESERVED3            :11;
        };
    };
} stc_flash_if_crtrmm_field_t;

typedef struct stc_flash_if_fgpdm1_field
{
    union {
        struct {
            __IO  uint32_t  GPD1                 :32;
        };
        struct {
            __IO  uint32_t  GPD10                :1;
            __IO  uint32_t  GPD11                :1;
            __IO  uint32_t  GPD12                :1;
            __IO  uint32_t  GPD13                :1;
            __IO  uint32_t  GPD14                :1;
            __IO  uint32_t  GPD15                :1;
            __IO  uint32_t  GPD16                :1;
            __IO  uint32_t  GPD17                :1;
            __IO  uint32_t  GPD18                :1;
            __IO  uint32_t  GPD19                :1;
            __IO  uint32_t  GPD110               :1;
            __IO  uint32_t  GPD111               :1;
            __IO  uint32_t  GPD112               :1;
            __IO  uint32_t  GPD113               :1;
            __IO  uint32_t  GPD114               :1;
            __IO  uint32_t  GPD115               :1;
            __IO  uint32_t  GPD116               :1;
            __IO  uint32_t  GPD117               :1;
            __IO  uint32_t  GPD118               :1;
            __IO  uint32_t  GPD119               :1;
            __IO  uint32_t  GPD120               :1;
            __IO  uint32_t  GPD121               :1;
            __IO  uint32_t  GPD122               :1;
            __IO  uint32_t  GPD123               :1;
            __IO  uint32_t  GPD124               :1;
            __IO  uint32_t  GPD125               :1;
            __IO  uint32_t  GPD126               :1;
            __IO  uint32_t  GPD127               :1;
            __IO  uint32_t  GPD128               :1;
            __IO  uint32_t  GPD129               :1;
            __IO  uint32_t  GPD130               :1;
            __IO  uint32_t  GPD131               :1;
        };
    };
} stc_flash_if_fgpdm1_field_t;

typedef struct stc_flash_if_fgpdm2_field
{
    union {
        struct {
            __IO  uint32_t  GPD2                 :32;
        };
        struct {
            __IO  uint32_t  GPD20                :1;
            __IO  uint32_t  GPD21                :1;
            __IO  uint32_t  GPD22                :1;
            __IO  uint32_t  GPD23                :1;
            __IO  uint32_t  GPD24                :1;
            __IO  uint32_t  GPD25                :1;
            __IO  uint32_t  GPD26                :1;
            __IO  uint32_t  GPD27                :1;
            __IO  uint32_t  GPD28                :1;
            __IO  uint32_t  GPD29                :1;
            __IO  uint32_t  GPD210               :1;
            __IO  uint32_t  GPD211               :1;
            __IO  uint32_t  GPD212               :1;
            __IO  uint32_t  GPD213               :1;
            __IO  uint32_t  GPD214               :1;
            __IO  uint32_t  GPD215               :1;
            __IO  uint32_t  GPD216               :1;
            __IO  uint32_t  GPD217               :1;
            __IO  uint32_t  GPD218               :1;
            __IO  uint32_t  GPD219               :1;
            __IO  uint32_t  GPD220               :1;
            __IO  uint32_t  GPD221               :1;
            __IO  uint32_t  GPD222               :1;
            __IO  uint32_t  GPD223               :1;
            __IO  uint32_t  GPD224               :1;
            __IO  uint32_t  GPD225               :1;
            __IO  uint32_t  GPD226               :1;
            __IO  uint32_t  GPD227               :1;
            __IO  uint32_t  GPD228               :1;
            __IO  uint32_t  GPD229               :1;
            __IO  uint32_t  GPD230               :1;
            __IO  uint32_t  GPD231               :1;
        };
    };
} stc_flash_if_fgpdm2_field_t;

typedef struct stc_flash_if_fgpdm3_field
{
    union {
        struct {
            __IO  uint32_t  GPD3                 :32;
        };
        struct {
            __IO  uint32_t  GPD30                :1;
            __IO  uint32_t  GPD31                :1;
            __IO  uint32_t  GPD32                :1;
            __IO  uint32_t  GPD33                :1;
            __IO  uint32_t  GPD34                :1;
            __IO  uint32_t  GPD35                :1;
            __IO  uint32_t  GPD36                :1;
            __IO  uint32_t  GPD37                :1;
            __IO  uint32_t  GPD38                :1;
            __IO  uint32_t  GPD39                :1;
            __IO  uint32_t  GPD310               :1;
            __IO  uint32_t  GPD311               :1;
            __IO  uint32_t  GPD312               :1;
            __IO  uint32_t  GPD313               :1;
            __IO  uint32_t  GPD314               :1;
            __IO  uint32_t  GPD315               :1;
            __IO  uint32_t  GPD316               :1;
            __IO  uint32_t  GPD317               :1;
            __IO  uint32_t  GPD318               :1;
            __IO  uint32_t  GPD319               :1;
            __IO  uint32_t  GPD320               :1;
            __IO  uint32_t  GPD321               :1;
            __IO  uint32_t  GPD322               :1;
            __IO  uint32_t  GPD323               :1;
            __IO  uint32_t  GPD324               :1;
            __IO  uint32_t  GPD325               :1;
            __IO  uint32_t  GPD326               :1;
            __IO  uint32_t  GPD327               :1;
            __IO  uint32_t  GPD328               :1;
            __IO  uint32_t  GPD329               :1;
            __IO  uint32_t  GPD330               :1;
            __IO  uint32_t  GPD331               :1;
        };
    };
} stc_flash_if_fgpdm3_field_t;

typedef struct stc_flash_if_fgpdm4_field
{
    union {
        struct {
            __IO  uint32_t  GPD4                 :32;
        };
        struct {
            __IO  uint32_t  GPD40                :1;
            __IO  uint32_t  GPD41                :1;
            __IO  uint32_t  GPD42                :1;
            __IO  uint32_t  GPD43                :1;
            __IO  uint32_t  GPD44                :1;
            __IO  uint32_t  GPD45                :1;
            __IO  uint32_t  GPD46                :1;
            __IO  uint32_t  GPD47                :1;
            __IO  uint32_t  GPD48                :1;
            __IO  uint32_t  GPD49                :1;
            __IO  uint32_t  GPD410               :1;
            __IO  uint32_t  GPD411               :1;
            __IO  uint32_t  GPD412               :1;
            __IO  uint32_t  GPD413               :1;
            __IO  uint32_t  GPD414               :1;
            __IO  uint32_t  GPD415               :1;
            __IO  uint32_t  GPD416               :1;
            __IO  uint32_t  GPD417               :1;
            __IO  uint32_t  GPD418               :1;
            __IO  uint32_t  GPD419               :1;
            __IO  uint32_t  GPD420               :1;
            __IO  uint32_t  GPD421               :1;
            __IO  uint32_t  GPD422               :1;
            __IO  uint32_t  GPD423               :1;
            __IO  uint32_t  GPD424               :1;
            __IO  uint32_t  GPD425               :1;
            __IO  uint32_t  GPD426               :1;
            __IO  uint32_t  GPD427               :1;
            __IO  uint32_t  GPD428               :1;
            __IO  uint32_t  GPD429               :1;
            __IO  uint32_t  GPD430               :1;
            __IO  uint32_t  GPD431               :1;
        };
    };
} stc_flash_if_fgpdm4_field_t;

