mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
typedef struct stc_smcif_portcontrol_field
{
        __IO  uint16_t  TRIMOD                   :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  IO1                      :1;
        __IO  uint16_t  RESERVED1                :1;
        __IO  uint16_t  IO1EN                    :1;
        __IO  uint16_t  RESERVED2                :1;
        __IO  uint16_t  CLKPT                    :1;
        __IO  uint16_t  RST                      :1;
        __IO  uint16_t  VCCEN                    :1;
        __IO  uint16_t  VPEN                     :1;
        __IO  uint16_t  RESERVED3                :2;
        __IO  uint16_t  CLKOUTEN                 :1;
        __IO  uint16_t  RSTOUTEN                 :1;
        __IO  uint16_t  VCCOUTEN                 :1;
        __IO  uint16_t  VPENOUTEN                :1;
} stc_smcif_portcontrol_field_t;

typedef struct stc_smcif_data_field
{
    union {
        struct {
            __IO  uint16_t  DATA                 :9;
            __IO  uint16_t  RESERVED0            :7;
        };
        struct {
            __IO  uint16_t  DATA0                :1;
            __IO  uint16_t  DATA1                :1;
            __IO  uint16_t  DATA2                :1;
            __IO  uint16_t  DATA3                :1;
            __IO  uint16_t  DATA4                :1;
            __IO  uint16_t  DATA5                :1;
            __IO  uint16_t  DATA6                :1;
            __IO  uint16_t  DATA7                :1;
            __IO  uint16_t  DATA8                :1;
            __IO  uint16_t  RESERVED1            :7;
        };
    };
} stc_smcif_data_field_t;

typedef struct stc_smcif_cardclock_field
{
    union {
        struct {
            __IO  uint16_t  CLKDIVIDER           :16;
        };
        struct {
            __IO  uint16_t  CLKDIVIDER0          :1;
            __IO  uint16_t  CLKDIVIDER1          :1;
            __IO  uint16_t  CLKDIVIDER2          :1;
            __IO  uint16_t  CLKDIVIDER3          :1;
            __IO  uint16_t  CLKDIVIDER4          :1;
            __IO  uint16_t  CLKDIVIDER5          :1;
            __IO  uint16_t  CLKDIVIDER6          :1;
            __IO  uint16_t  CLKDIVIDER7          :1;
            __IO  uint16_t  CLKDIVIDER8          :1;
            __IO  uint16_t  CLKDIVIDER9          :1;
            __IO  uint16_t  CLKDIVIDER10         :1;
            __IO  uint16_t  CLKDIVIDER11         :1;
            __IO  uint16_t  CLKDIVIDER12         :1;
            __IO  uint16_t  CLKDIVIDER13         :1;
            __IO  uint16_t  CLKDIVIDER14         :1;
            __IO  uint16_t  CLKDIVIDER15         :1;
        };
    };
} stc_smcif_cardclock_field_t;

typedef struct stc_smcif_baudrate_field
{
    union {
        struct {
            __IO  uint16_t  BRREG                :15;
            __IO  uint16_t  LITTLESTEP           :1;
        };
        struct {
            __IO  uint16_t  BRREG0               :1;
            __IO  uint16_t  BRREG1               :1;
            __IO  uint16_t  BRREG2               :1;
            __IO  uint16_t  BRREG3               :1;
            __IO  uint16_t  BRREG4               :1;
            __IO  uint16_t  BRREG5               :1;
            __IO  uint16_t  BRREG6               :1;
            __IO  uint16_t  BRREG7               :1;
            __IO  uint16_t  BRREG8               :1;
            __IO  uint16_t  BRREG9               :1;
            __IO  uint16_t  BRREG10              :1;
            __IO  uint16_t  BRREG11              :1;
            __IO  uint16_t  BRREG12              :1;
            __IO  uint16_t  BRREG13              :1;
            __IO  uint16_t  BRREG14              :1;
            __IO  uint16_t  RESERVED0            :1;
        };
    };
} stc_smcif_baudrate_field_t;

typedef struct stc_smcif_guardtimer_field
{
    union {
        struct {
            __IO  uint16_t  GTREG                :8;
            __IO  uint16_t  RESERVED0            :8;
        };
        struct {
            __IO  uint16_t  GTREG0               :1;
            __IO  uint16_t  GTREG1               :1;
            __IO  uint16_t  GTREG2               :1;
            __IO  uint16_t  GTREG3               :1;
            __IO  uint16_t  GTREG4               :1;
            __IO  uint16_t  GTREG5               :1;
            __IO  uint16_t  GTREG6               :1;
            __IO  uint16_t  GTREG7               :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_smcif_guardtimer_field_t;

typedef struct stc_smcif_idletimer_field
{
    union {
        struct {
            __IO  uint16_t  IDTREG               :16;
        };
        struct {
            __IO  uint16_t  IDTREG0              :1;
            __IO  uint16_t  IDTREG1              :1;
            __IO  uint16_t  IDTREG2              :1;
            __IO  uint16_t  IDTREG3              :1;
            __IO  uint16_t  IDTREG4              :1;
            __IO  uint16_t  IDTREG5              :1;
            __IO  uint16_t  IDTREG6              :1;
            __IO  uint16_t  IDTREG7              :1;
            __IO  uint16_t  IDTREG8              :1;
            __IO  uint16_t  IDTREG9              :1;
            __IO  uint16_t  IDTREG10             :1;
            __IO  uint16_t  IDTREG11             :1;
            __IO  uint16_t  IDTREG12             :1;
            __IO  uint16_t  IDTREG13             :1;
            __IO  uint16_t  IDTREG14             :1;
            __IO  uint16_t  IDTREG15             :1;
        };
    };
} stc_smcif_idletimer_field_t;

typedef struct stc_smcif_globalcontrol2_field
{
        __IO  uint16_t  RX8N1                    :1;
        __IO  uint16_t  INVDATAOUT               :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  ICCDISABLE               :1;
        __IO  uint16_t  RESERVED1                :12;
} stc_smcif_globalcontrol2_field_t;

typedef struct stc_smcif_data_fifo_field
{
    union {
        struct {
            __IO  uint16_t  DATA                 :9;
            __IO  uint16_t  RESERVED0            :7;
        };
        struct {
            __IO  uint16_t  DATA0                :1;
            __IO  uint16_t  DATA1                :1;
            __IO  uint16_t  DATA2                :1;
            __IO  uint16_t  DATA3                :1;
            __IO  uint16_t  DATA4                :1;
            __IO  uint16_t  DATA5                :1;
            __IO  uint16_t  DATA6                :1;
            __IO  uint16_t  DATA7                :1;
            __IO  uint16_t  DATA8                :1;
            __IO  uint16_t  RESERVED1            :7;
        };
    };
} stc_smcif_data_fifo_field_t;

