mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
#define bFM_GPIO_PCR7_P0                          *((volatile  uint8_t *)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P0                         *((volatile  uint8_t *)(0x42DE2380UL))
#define bFM_GPIO_PCR7_P1                          *((volatile  uint8_t *)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P1                         *((volatile  uint8_t *)(0x42DE2384UL))
#define bFM_GPIO_PCR7_P2                          *((volatile  uint8_t *)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P2                         *((volatile  uint8_t *)(0x42DE2388UL))
#define bFM_GPIO_PCR7_P3                          *((volatile  uint8_t *)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P3                         *((volatile  uint8_t *)(0x42DE238CUL))
#define bFM_GPIO_PCR7_P4                          *((volatile  uint8_t *)(0x42DE2390UL))
#define bFM4_GPIO_PCR7_P4                         *((volatile  uint8_t *)(0x42DE2390UL))
#define bFM_GPIO_PCR7_P5                          *((volatile  uint8_t *)(0x42DE2394UL))
#define bFM4_GPIO_PCR7_P5                         *((volatile  uint8_t *)(0x42DE2394UL))
#define bFM_GPIO_PCR7_P6                          *((volatile  uint8_t *)(0x42DE2398UL))
#define bFM4_GPIO_PCR7_P6                         *((volatile  uint8_t *)(0x42DE2398UL))
#define bFM_GPIO_PCR7_P7                          *((volatile  uint8_t *)(0x42DE239CUL))
#define bFM4_GPIO_PCR7_P7                         *((volatile  uint8_t *)(0x42DE239CUL))
#define bFM_GPIO_PCR7_P8                          *((volatile  uint8_t *)(0x42DE23A0UL))
#define bFM4_GPIO_PCR7_P8                         *((volatile  uint8_t *)(0x42DE23A0UL))
#define bFM_GPIO_PCR7_P9                          *((volatile  uint8_t *)(0x42DE23A4UL))
#define bFM4_GPIO_PCR7_P9                         *((volatile  uint8_t *)(0x42DE23A4UL))
#define bFM_GPIO_PCR7_PA                          *((volatile  uint8_t *)(0x42DE23A8UL))
#define bFM4_GPIO_PCR7_PA                         *((volatile  uint8_t *)(0x42DE23A8UL))

#define bFM_GPIO_PCRA_P0                          *((volatile  uint8_t *)(0x42DE2500UL))
#define bFM4_GPIO_PCRA_P0                         *((volatile  uint8_t *)(0x42DE2500UL))
#define bFM_GPIO_PCRA_P1                          *((volatile  uint8_t *)(0x42DE2504UL))
#define bFM4_GPIO_PCRA_P1                         *((volatile  uint8_t *)(0x42DE2504UL))
#define bFM_GPIO_PCRA_P2                          *((volatile  uint8_t *)(0x42DE2508UL))
#define bFM4_GPIO_PCRA_P2                         *((volatile  uint8_t *)(0x42DE2508UL))
#define bFM_GPIO_PCRA_P3                          *((volatile  uint8_t *)(0x42DE250CUL))
#define bFM4_GPIO_PCRA_P3                         *((volatile  uint8_t *)(0x42DE250CUL))
#define bFM_GPIO_PCRA_P4                          *((volatile  uint8_t *)(0x42DE2510UL))
#define bFM4_GPIO_PCRA_P4                         *((volatile  uint8_t *)(0x42DE2510UL))
#define bFM_GPIO_PCRA_P5                          *((volatile  uint8_t *)(0x42DE2514UL))
#define bFM4_GPIO_PCRA_P5                         *((volatile  uint8_t *)(0x42DE2514UL))
#define bFM_GPIO_PCRA_P6                          *((volatile  uint8_t *)(0x42DE2518UL))
#define bFM4_GPIO_PCRA_P6                         *((volatile  uint8_t *)(0x42DE2518UL))
#define bFM_GPIO_PCRA_P7                          *((volatile  uint8_t *)(0x42DE251CUL))
#define bFM4_GPIO_PCRA_P7                         *((volatile  uint8_t *)(0x42DE251CUL))
#define bFM_GPIO_PCRA_P8                          *((volatile  uint8_t *)(0x42DE2520UL))
#define bFM4_GPIO_PCRA_P8                         *((volatile  uint8_t *)(0x42DE2520UL))
#define bFM_GPIO_PCRA_P9                          *((volatile  uint8_t *)(0x42DE2524UL))
#define bFM4_GPIO_PCRA_P9                         *((volatile  uint8_t *)(0x42DE2524UL))
#define bFM_GPIO_PCRA_PA                          *((volatile  uint8_t *)(0x42DE2528UL))
#define bFM4_GPIO_PCRA_PA                         *((volatile  uint8_t *)(0x42DE2528UL))
#define bFM_GPIO_PCRA_PB                          *((volatile  uint8_t *)(0x42DE252CUL))
#define bFM4_GPIO_PCRA_PB                         *((volatile  uint8_t *)(0x42DE252CUL))
#define bFM_GPIO_PCRA_PC                          *((volatile  uint8_t *)(0x42DE2530UL))
#define bFM4_GPIO_PCRA_PC                         *((volatile  uint8_t *)(0x42DE2530UL))
#define bFM_GPIO_PCRA_PD                          *((volatile  uint8_t *)(0x42DE2534UL))
#define bFM4_GPIO_PCRA_PD                         *((volatile  uint8_t *)(0x42DE2534UL))
#define bFM_GPIO_PCRA_PE                          *((volatile  uint8_t *)(0x42DE2538UL))
#define bFM4_GPIO_PCRA_PE                         *((volatile  uint8_t *)(0x42DE2538UL))
#define bFM_GPIO_PCRA_PF                          *((volatile  uint8_t *)(0x42DE253CUL))
#define bFM4_GPIO_PCRA_PF                         *((volatile  uint8_t *)(0x42DE253CUL))

#define bFM_GPIO_PCRC_P0                          *((volatile  uint8_t *)(0x42DE2600UL))
#define bFM4_GPIO_PCRC_P0                         *((volatile  uint8_t *)(0x42DE2600UL))
#define bFM_GPIO_PCRC_P1                          *((volatile  uint8_t *)(0x42DE2604UL))
#define bFM4_GPIO_PCRC_P1                         *((volatile  uint8_t *)(0x42DE2604UL))
#define bFM_GPIO_PCRC_P2                          *((volatile  uint8_t *)(0x42DE2608UL))
#define bFM4_GPIO_PCRC_P2                         *((volatile  uint8_t *)(0x42DE2608UL))
#define bFM_GPIO_PCRC_P3                          *((volatile  uint8_t *)(0x42DE260CUL))
#define bFM4_GPIO_PCRC_P3                         *((volatile  uint8_t *)(0x42DE260CUL))
#define bFM_GPIO_PCRC_P4                          *((volatile  uint8_t *)(0x42DE2610UL))
#define bFM4_GPIO_PCRC_P4                         *((volatile  uint8_t *)(0x42DE2610UL))
#define bFM_GPIO_PCRC_P5                          *((volatile  uint8_t *)(0x42DE2614UL))
#define bFM4_GPIO_PCRC_P5                         *((volatile  uint8_t *)(0x42DE2614UL))
#define bFM_GPIO_PCRC_P6                          *((volatile  uint8_t *)(0x42DE2618UL))
#define bFM4_GPIO_PCRC_P6                         *((volatile  uint8_t *)(0x42DE2618UL))
#define bFM_GPIO_PCRC_P7                          *((volatile  uint8_t *)(0x42DE261CUL))
#define bFM4_GPIO_PCRC_P7                         *((volatile  uint8_t *)(0x42DE261CUL))
#define bFM_GPIO_PCRC_P8                          *((volatile  uint8_t *)(0x42DE2620UL))
#define bFM4_GPIO_PCRC_P8                         *((volatile  uint8_t *)(0x42DE2620UL))
#define bFM_GPIO_PCRC_P9                          *((volatile  uint8_t *)(0x42DE2624UL))
#define bFM4_GPIO_PCRC_P9                         *((volatile  uint8_t *)(0x42DE2624UL))
#define bFM_GPIO_PCRC_PA                          *((volatile  uint8_t *)(0x42DE2628UL))
#define bFM4_GPIO_PCRC_PA                         *((volatile  uint8_t *)(0x42DE2628UL))
#define bFM_GPIO_PCRC_PB                          *((volatile  uint8_t *)(0x42DE262CUL))
#define bFM4_GPIO_PCRC_PB                         *((volatile  uint8_t *)(0x42DE262CUL))
#define bFM_GPIO_PCRC_PC                          *((volatile  uint8_t *)(0x42DE2630UL))
#define bFM4_GPIO_PCRC_PC                         *((volatile  uint8_t *)(0x42DE2630UL))
#define bFM_GPIO_PCRC_PD                          *((volatile  uint8_t *)(0x42DE2634UL))
#define bFM4_GPIO_PCRC_PD                         *((volatile  uint8_t *)(0x42DE2634UL))
#define bFM_GPIO_PCRC_PE                          *((volatile  uint8_t *)(0x42DE2638UL))
#define bFM4_GPIO_PCRC_PE                         *((volatile  uint8_t *)(0x42DE2638UL))
#define bFM_GPIO_PCRC_PF                          *((volatile  uint8_t *)(0x42DE263CUL))
#define bFM4_GPIO_PCRC_PF                         *((volatile  uint8_t *)(0x42DE263CUL))

#define bFM_GPIO_PCRD_P0                          *((volatile  uint8_t *)(0x42DE2680UL))
#define bFM4_GPIO_PCRD_P0                         *((volatile  uint8_t *)(0x42DE2680UL))
#define bFM_GPIO_PCRD_P1                          *((volatile  uint8_t *)(0x42DE2684UL))
#define bFM4_GPIO_PCRD_P1                         *((volatile  uint8_t *)(0x42DE2684UL))
#define bFM_GPIO_PCRD_P2                          *((volatile  uint8_t *)(0x42DE2688UL))
#define bFM4_GPIO_PCRD_P2                         *((volatile  uint8_t *)(0x42DE2688UL))

#define bFM_GPIO_PCRE_P0                          *((volatile  uint8_t *)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_P0                         *((volatile  uint8_t *)(0x42DE2700UL))
#define bFM_GPIO_PCRE_P2                          *((volatile  uint8_t *)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_P2                         *((volatile  uint8_t *)(0x42DE2708UL))
#define bFM_GPIO_PCRE_P3                          *((volatile  uint8_t *)(0x42DE270CUL))
#define bFM4_GPIO_PCRE_P3                         *((volatile  uint8_t *)(0x42DE270CUL))

#define bFM_GPIO_PDIR0_P0                         *((volatile  uint8_t *)(0x42DE6000UL))
#define bFM4_GPIO_PDIR0_P0                        *((volatile  uint8_t *)(0x42DE6000UL))
#define bFM_GPIO_PDIR0_P1                         *((volatile  uint8_t *)(0x42DE6004UL))
#define bFM4_GPIO_PDIR0_P1                        *((volatile  uint8_t *)(0x42DE6004UL))
#define bFM_GPIO_PDIR0_P2                         *((volatile  uint8_t *)(0x42DE6008UL))
#define bFM4_GPIO_PDIR0_P2                        *((volatile  uint8_t *)(0x42DE6008UL))
#define bFM_GPIO_PDIR0_P3                         *((volatile  uint8_t *)(0x42DE600CUL))
#define bFM4_GPIO_PDIR0_P3                        *((volatile  uint8_t *)(0x42DE600CUL))
#define bFM_GPIO_PDIR0_P4                         *((volatile  uint8_t *)(0x42DE6010UL))
#define bFM4_GPIO_PDIR0_P4                        *((volatile  uint8_t *)(0x42DE6010UL))
#define bFM_GPIO_PDIR0_P8                         *((volatile  uint8_t *)(0x42DE6020UL))
#define bFM4_GPIO_PDIR0_P8                        *((volatile  uint8_t *)(0x42DE6020UL))
#define bFM_GPIO_PDIR0_P9                         *((volatile  uint8_t *)(0x42DE6024UL))
#define bFM4_GPIO_PDIR0_P9                        *((volatile  uint8_t *)(0x42DE6024UL))
#define bFM_GPIO_PDIR0_PA                         *((volatile  uint8_t *)(0x42DE6028UL))
#define bFM4_GPIO_PDIR0_PA                        *((volatile  uint8_t *)(0x42DE6028UL))

#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P0                        *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P1                        *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P2                        *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P3                        *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P4                        *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P5                        *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P6                        *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P7                        *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P8                        *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_P9                        *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_PA                        *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_PB                        *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM_GPIO_PDIR1_PC                         *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_PC                        *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM_GPIO_PDIR1_PD                         *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_PD                        *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM_GPIO_PDIR1_PE                         *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_PE                        *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM_GPIO_PDIR1_PF                         *((volatile  uint8_t *)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR1_PF                        *((volatile  uint8_t *)(0x42DE60BCUL))

#define bFM_GPIO_PDIR2_P0                         *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P0                        *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P1                        *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P2                        *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P3                        *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM_GPIO_PDIR2_P4                         *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P4                        *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM_GPIO_PDIR2_P5                         *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P5                        *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM_GPIO_PDIR2_P6                         *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P6                        *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM_GPIO_PDIR2_P7                         *((volatile  uint8_t *)(0x42DE611CUL))
#define bFM4_GPIO_PDIR2_P7                        *((volatile  uint8_t *)(0x42DE611CUL))
#define bFM_GPIO_PDIR2_P8                         *((volatile  uint8_t *)(0x42DE6120UL))
#define bFM4_GPIO_PDIR2_P8                        *((volatile  uint8_t *)(0x42DE6120UL))
#define bFM_GPIO_PDIR2_P9                         *((volatile  uint8_t *)(0x42DE6124UL))
#define bFM4_GPIO_PDIR2_P9                        *((volatile  uint8_t *)(0x42DE6124UL))
#define bFM_GPIO_PDIR2_PA                         *((volatile  uint8_t *)(0x42DE6128UL))
#define bFM4_GPIO_PDIR2_PA                        *((volatile  uint8_t *)(0x42DE6128UL))

#define bFM_GPIO_PDIR3_P2                         *((volatile  uint8_t *)(0x42DE6188UL))
#define bFM4_GPIO_PDIR3_P2                        *((volatile  uint8_t *)(0x42DE6188UL))
#define bFM_GPIO_PDIR3_P3                         *((volatile  uint8_t *)(0x42DE618CUL))
#define bFM4_GPIO_PDIR3_P3                        *((volatile  uint8_t *)(0x42DE618CUL))
#define bFM_GPIO_PDIR3_P4                         *((volatile  uint8_t *)(0x42DE6190UL))
#define bFM4_GPIO_PDIR3_P4                        *((volatile  uint8_t *)(0x42DE6190UL))
#define bFM_GPIO_PDIR3_P5                         *((volatile  uint8_t *)(0x42DE6194UL))
#define bFM4_GPIO_PDIR3_P5                        *((volatile  uint8_t *)(0x42DE6194UL))
#define bFM_GPIO_PDIR3_P6                         *((volatile  uint8_t *)(0x42DE6198UL))
#define bFM4_GPIO_PDIR3_P6                        *((volatile  uint8_t *)(0x42DE6198UL))
#define bFM_GPIO_PDIR3_P7                         *((volatile  uint8_t *)(0x42DE619CUL))
#define bFM4_GPIO_PDIR3_P7                        *((volatile  uint8_t *)(0x42DE619CUL))
#define bFM_GPIO_PDIR3_P8                         *((volatile  uint8_t *)(0x42DE61A0UL))
#define bFM4_GPIO_PDIR3_P8                        *((volatile  uint8_t *)(0x42DE61A0UL))
#define bFM_GPIO_PDIR3_P9                         *((volatile  uint8_t *)(0x42DE61A4UL))
#define bFM4_GPIO_PDIR3_P9                        *((volatile  uint8_t *)(0x42DE61A4UL))
#define bFM_GPIO_PDIR3_PA                         *((volatile  uint8_t *)(0x42DE61A8UL))
#define bFM4_GPIO_PDIR3_PA                        *((volatile  uint8_t *)(0x42DE61A8UL))
#define bFM_GPIO_PDIR3_PB                         *((volatile  uint8_t *)(0x42DE61ACUL))
#define bFM4_GPIO_PDIR3_PB                        *((volatile  uint8_t *)(0x42DE61ACUL))
#define bFM_GPIO_PDIR3_PC                         *((volatile  uint8_t *)(0x42DE61B0UL))
#define bFM4_GPIO_PDIR3_PC                        *((volatile  uint8_t *)(0x42DE61B0UL))
#define bFM_GPIO_PDIR3_PD                         *((volatile  uint8_t *)(0x42DE61B4UL))
#define bFM4_GPIO_PDIR3_PD                        *((volatile  uint8_t *)(0x42DE61B4UL))
#define bFM_GPIO_PDIR3_PE                         *((volatile  uint8_t *)(0x42DE61B8UL))
#define bFM4_GPIO_PDIR3_PE                        *((volatile  uint8_t *)(0x42DE61B8UL))

#define bFM_GPIO_PDIR4_P0                         *((volatile  uint8_t *)(0x42DE6200UL))
#define bFM4_GPIO_PDIR4_P0                        *((volatile  uint8_t *)(0x42DE6200UL))
#define bFM_GPIO_PDIR4_P1                         *((volatile  uint8_t *)(0x42DE6204UL))
#define bFM4_GPIO_PDIR4_P1                        *((volatile  uint8_t *)(0x42DE6204UL))
#define bFM_GPIO_PDIR4_P2                         *((volatile  uint8_t *)(0x42DE6208UL))
#define bFM4_GPIO_PDIR4_P2                        *((volatile  uint8_t *)(0x42DE6208UL))
#define bFM_GPIO_PDIR4_P3                         *((volatile  uint8_t *)(0x42DE620CUL))
#define bFM4_GPIO_PDIR4_P3                        *((volatile  uint8_t *)(0x42DE620CUL))
#define bFM_GPIO_PDIR4_P4                         *((volatile  uint8_t *)(0x42DE6210UL))
#define bFM4_GPIO_PDIR4_P4                        *((volatile  uint8_t *)(0x42DE6210UL))
#define bFM_GPIO_PDIR4_P5                         *((volatile  uint8_t *)(0x42DE6214UL))
#define bFM4_GPIO_PDIR4_P5                        *((volatile  uint8_t *)(0x42DE6214UL))
#define bFM_GPIO_PDIR4_P6                         *((volatile  uint8_t *)(0x42DE6218UL))
#define bFM4_GPIO_PDIR4_P6                        *((volatile  uint8_t *)(0x42DE6218UL))
#define bFM_GPIO_PDIR4_P7                         *((volatile  uint8_t *)(0x42DE621CUL))
#define bFM4_GPIO_PDIR4_P7                        *((volatile  uint8_t *)(0x42DE621CUL))
#define bFM_GPIO_PDIR4_P8                         *((volatile  uint8_t *)(0x42DE6220UL))
#define bFM4_GPIO_PDIR4_P8                        *((volatile  uint8_t *)(0x42DE6220UL))
#define bFM_GPIO_PDIR4_P9                         *((volatile  uint8_t *)(0x42DE6224UL))
#define bFM4_GPIO_PDIR4_P9                        *((volatile  uint8_t *)(0x42DE6224UL))
#define bFM_GPIO_PDIR4_PA                         *((volatile  uint8_t *)(0x42DE6228UL))
#define bFM4_GPIO_PDIR4_PA                        *((volatile  uint8_t *)(0x42DE6228UL))
#define bFM_GPIO_PDIR4_PB                         *((volatile  uint8_t *)(0x42DE622CUL))
#define bFM4_GPIO_PDIR4_PB                        *((volatile  uint8_t *)(0x42DE622CUL))
#define bFM_GPIO_PDIR4_PC                         *((volatile  uint8_t *)(0x42DE6230UL))
#define bFM4_GPIO_PDIR4_PC                        *((volatile  uint8_t *)(0x42DE6230UL))
#define bFM_GPIO_PDIR4_PD                         *((volatile  uint8_t *)(0x42DE6234UL))
#define bFM4_GPIO_PDIR4_PD                        *((volatile  uint8_t *)(0x42DE6234UL))
#define bFM_GPIO_PDIR4_PE                         *((volatile  uint8_t *)(0x42DE6238UL))
#define bFM4_GPIO_PDIR4_PE                        *((volatile  uint8_t *)(0x42DE6238UL))

