mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
#define bFM_GPIO_PFRC_P0                          *((volatile  uint8_t *)(0x42DE0600UL))
#define bFM4_GPIO_PFRC_P0                         *((volatile  uint8_t *)(0x42DE0600UL))
#define bFM_GPIO_PFRC_P1                          *((volatile  uint8_t *)(0x42DE0604UL))
#define bFM4_GPIO_PFRC_P1                         *((volatile  uint8_t *)(0x42DE0604UL))
#define bFM_GPIO_PFRC_P2                          *((volatile  uint8_t *)(0x42DE0608UL))
#define bFM4_GPIO_PFRC_P2                         *((volatile  uint8_t *)(0x42DE0608UL))
#define bFM_GPIO_PFRC_P3                          *((volatile  uint8_t *)(0x42DE060CUL))
#define bFM4_GPIO_PFRC_P3                         *((volatile  uint8_t *)(0x42DE060CUL))
#define bFM_GPIO_PFRC_P4                          *((volatile  uint8_t *)(0x42DE0610UL))
#define bFM4_GPIO_PFRC_P4                         *((volatile  uint8_t *)(0x42DE0610UL))
#define bFM_GPIO_PFRC_P5                          *((volatile  uint8_t *)(0x42DE0614UL))
#define bFM4_GPIO_PFRC_P5                         *((volatile  uint8_t *)(0x42DE0614UL))
#define bFM_GPIO_PFRC_P6                          *((volatile  uint8_t *)(0x42DE0618UL))
#define bFM4_GPIO_PFRC_P6                         *((volatile  uint8_t *)(0x42DE0618UL))
#define bFM_GPIO_PFRC_P7                          *((volatile  uint8_t *)(0x42DE061CUL))
#define bFM4_GPIO_PFRC_P7                         *((volatile  uint8_t *)(0x42DE061CUL))
#define bFM_GPIO_PFRC_P8                          *((volatile  uint8_t *)(0x42DE0620UL))
#define bFM4_GPIO_PFRC_P8                         *((volatile  uint8_t *)(0x42DE0620UL))
#define bFM_GPIO_PFRC_P9                          *((volatile  uint8_t *)(0x42DE0624UL))
#define bFM4_GPIO_PFRC_P9                         *((volatile  uint8_t *)(0x42DE0624UL))
#define bFM_GPIO_PFRC_PA                          *((volatile  uint8_t *)(0x42DE0628UL))
#define bFM4_GPIO_PFRC_PA                         *((volatile  uint8_t *)(0x42DE0628UL))
#define bFM_GPIO_PFRC_PB                          *((volatile  uint8_t *)(0x42DE062CUL))
#define bFM4_GPIO_PFRC_PB                         *((volatile  uint8_t *)(0x42DE062CUL))
#define bFM_GPIO_PFRC_PC                          *((volatile  uint8_t *)(0x42DE0630UL))
#define bFM4_GPIO_PFRC_PC                         *((volatile  uint8_t *)(0x42DE0630UL))
#define bFM_GPIO_PFRC_PD                          *((volatile  uint8_t *)(0x42DE0634UL))
#define bFM4_GPIO_PFRC_PD                         *((volatile  uint8_t *)(0x42DE0634UL))
#define bFM_GPIO_PFRC_PE                          *((volatile  uint8_t *)(0x42DE0638UL))
#define bFM4_GPIO_PFRC_PE                         *((volatile  uint8_t *)(0x42DE0638UL))
#define bFM_GPIO_PFRC_PF                          *((volatile  uint8_t *)(0x42DE063CUL))
#define bFM4_GPIO_PFRC_PF                         *((volatile  uint8_t *)(0x42DE063CUL))

#define bFM_GPIO_PFRD_P0                          *((volatile  uint8_t *)(0x42DE0680UL))
#define bFM4_GPIO_PFRD_P0                         *((volatile  uint8_t *)(0x42DE0680UL))
#define bFM_GPIO_PFRD_P1                          *((volatile  uint8_t *)(0x42DE0684UL))
#define bFM4_GPIO_PFRD_P1                         *((volatile  uint8_t *)(0x42DE0684UL))
#define bFM_GPIO_PFRD_P2                          *((volatile  uint8_t *)(0x42DE0688UL))
#define bFM4_GPIO_PFRD_P2                         *((volatile  uint8_t *)(0x42DE0688UL))

#define bFM_GPIO_PFRE_P0                          *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P0                         *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P2                         *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x42DE070CUL))
#define bFM4_GPIO_PFRE_P3                         *((volatile  uint8_t *)(0x42DE070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM4_GPIO_PZR0_P0                         *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM4_GPIO_PZR0_P1                         *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM4_GPIO_PZR0_P2                         *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM4_GPIO_PZR0_P3                         *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile  uint8_t *)(0x42DEE010UL))
#define bFM4_GPIO_PZR0_P4                         *((volatile  uint8_t *)(0x42DEE010UL))
#define bFM_GPIO_PZR0_P8                          *((volatile  uint8_t *)(0x42DEE020UL))
#define bFM4_GPIO_PZR0_P8                         *((volatile  uint8_t *)(0x42DEE020UL))
#define bFM_GPIO_PZR0_P9                          *((volatile  uint8_t *)(0x42DEE024UL))
#define bFM4_GPIO_PZR0_P9                         *((volatile  uint8_t *)(0x42DEE024UL))
#define bFM_GPIO_PZR0_PA                          *((volatile  uint8_t *)(0x42DEE028UL))
#define bFM4_GPIO_PZR0_PA                         *((volatile  uint8_t *)(0x42DEE028UL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P0                         *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P1                         *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P2                         *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P3                         *((volatile  uint8_t *)(0x42DEE08CUL))
#define bFM_GPIO_PZR1_P4                          *((volatile  uint8_t *)(0x42DEE090UL))
#define bFM4_GPIO_PZR1_P4                         *((volatile  uint8_t *)(0x42DEE090UL))
#define bFM_GPIO_PZR1_P5                          *((volatile  uint8_t *)(0x42DEE094UL))
#define bFM4_GPIO_PZR1_P5                         *((volatile  uint8_t *)(0x42DEE094UL))
#define bFM_GPIO_PZR1_P6                          *((volatile  uint8_t *)(0x42DEE098UL))
#define bFM4_GPIO_PZR1_P6                         *((volatile  uint8_t *)(0x42DEE098UL))
#define bFM_GPIO_PZR1_P7                          *((volatile  uint8_t *)(0x42DEE09CUL))
#define bFM4_GPIO_PZR1_P7                         *((volatile  uint8_t *)(0x42DEE09CUL))
#define bFM_GPIO_PZR1_P8                          *((volatile  uint8_t *)(0x42DEE0A0UL))
#define bFM4_GPIO_PZR1_P8                         *((volatile  uint8_t *)(0x42DEE0A0UL))
#define bFM_GPIO_PZR1_P9                          *((volatile  uint8_t *)(0x42DEE0A4UL))
#define bFM4_GPIO_PZR1_P9                         *((volatile  uint8_t *)(0x42DEE0A4UL))
#define bFM_GPIO_PZR1_PA                          *((volatile  uint8_t *)(0x42DEE0A8UL))
#define bFM4_GPIO_PZR1_PA                         *((volatile  uint8_t *)(0x42DEE0A8UL))
#define bFM_GPIO_PZR1_PB                          *((volatile  uint8_t *)(0x42DEE0ACUL))
#define bFM4_GPIO_PZR1_PB                         *((volatile  uint8_t *)(0x42DEE0ACUL))
#define bFM_GPIO_PZR1_PC                          *((volatile  uint8_t *)(0x42DEE0B0UL))
#define bFM4_GPIO_PZR1_PC                         *((volatile  uint8_t *)(0x42DEE0B0UL))
#define bFM_GPIO_PZR1_PD                          *((volatile  uint8_t *)(0x42DEE0B4UL))
#define bFM4_GPIO_PZR1_PD                         *((volatile  uint8_t *)(0x42DEE0B4UL))
#define bFM_GPIO_PZR1_PE                          *((volatile  uint8_t *)(0x42DEE0B8UL))
#define bFM4_GPIO_PZR1_PE                         *((volatile  uint8_t *)(0x42DEE0B8UL))
#define bFM_GPIO_PZR1_PF                          *((volatile  uint8_t *)(0x42DEE0BCUL))
#define bFM4_GPIO_PZR1_PF                         *((volatile  uint8_t *)(0x42DEE0BCUL))

#define bFM_GPIO_PZR2_P0                          *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P0                         *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P1                         *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P2                         *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P3                         *((volatile  uint8_t *)(0x42DEE10CUL))
#define bFM_GPIO_PZR2_P4                          *((volatile  uint8_t *)(0x42DEE110UL))
#define bFM4_GPIO_PZR2_P4                         *((volatile  uint8_t *)(0x42DEE110UL))
#define bFM_GPIO_PZR2_P5                          *((volatile  uint8_t *)(0x42DEE114UL))
#define bFM4_GPIO_PZR2_P5                         *((volatile  uint8_t *)(0x42DEE114UL))
#define bFM_GPIO_PZR2_P6                          *((volatile  uint8_t *)(0x42DEE118UL))
#define bFM4_GPIO_PZR2_P6                         *((volatile  uint8_t *)(0x42DEE118UL))
#define bFM_GPIO_PZR2_P7                          *((volatile  uint8_t *)(0x42DEE11CUL))
#define bFM4_GPIO_PZR2_P7                         *((volatile  uint8_t *)(0x42DEE11CUL))
#define bFM_GPIO_PZR2_P8                          *((volatile  uint8_t *)(0x42DEE120UL))
#define bFM4_GPIO_PZR2_P8                         *((volatile  uint8_t *)(0x42DEE120UL))
#define bFM_GPIO_PZR2_P9                          *((volatile  uint8_t *)(0x42DEE124UL))
#define bFM4_GPIO_PZR2_P9                         *((volatile  uint8_t *)(0x42DEE124UL))
#define bFM_GPIO_PZR2_PA                          *((volatile  uint8_t *)(0x42DEE128UL))
#define bFM4_GPIO_PZR2_PA                         *((volatile  uint8_t *)(0x42DEE128UL))

#define bFM_GPIO_PZR3_P2                          *((volatile  uint8_t *)(0x42DEE188UL))
#define bFM4_GPIO_PZR3_P2                         *((volatile  uint8_t *)(0x42DEE188UL))
#define bFM_GPIO_PZR3_P3                          *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P3                         *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM_GPIO_PZR3_P4                          *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P4                         *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM_GPIO_PZR3_P5                          *((volatile  uint8_t *)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P5                         *((volatile  uint8_t *)(0x42DEE194UL))
#define bFM_GPIO_PZR3_P6                          *((volatile  uint8_t *)(0x42DEE198UL))
#define bFM4_GPIO_PZR3_P6                         *((volatile  uint8_t *)(0x42DEE198UL))
#define bFM_GPIO_PZR3_P7                          *((volatile  uint8_t *)(0x42DEE19CUL))
#define bFM4_GPIO_PZR3_P7                         *((volatile  uint8_t *)(0x42DEE19CUL))
#define bFM_GPIO_PZR3_P8                          *((volatile  uint8_t *)(0x42DEE1A0UL))
#define bFM4_GPIO_PZR3_P8                         *((volatile  uint8_t *)(0x42DEE1A0UL))
#define bFM_GPIO_PZR3_P9                          *((volatile  uint8_t *)(0x42DEE1A4UL))
#define bFM4_GPIO_PZR3_P9                         *((volatile  uint8_t *)(0x42DEE1A4UL))
#define bFM_GPIO_PZR3_PA                          *((volatile  uint8_t *)(0x42DEE1A8UL))
#define bFM4_GPIO_PZR3_PA                         *((volatile  uint8_t *)(0x42DEE1A8UL))
#define bFM_GPIO_PZR3_PB                          *((volatile  uint8_t *)(0x42DEE1ACUL))
#define bFM4_GPIO_PZR3_PB                         *((volatile  uint8_t *)(0x42DEE1ACUL))
#define bFM_GPIO_PZR3_PC                          *((volatile  uint8_t *)(0x42DEE1B0UL))
#define bFM4_GPIO_PZR3_PC                         *((volatile  uint8_t *)(0x42DEE1B0UL))
#define bFM_GPIO_PZR3_PD                          *((volatile  uint8_t *)(0x42DEE1B4UL))
#define bFM4_GPIO_PZR3_PD                         *((volatile  uint8_t *)(0x42DEE1B4UL))
#define bFM_GPIO_PZR3_PE                          *((volatile  uint8_t *)(0x42DEE1B8UL))
#define bFM4_GPIO_PZR3_PE                         *((volatile  uint8_t *)(0x42DEE1B8UL))

#define bFM_GPIO_PZR4_P0                          *((volatile  uint8_t *)(0x42DEE200UL))
#define bFM4_GPIO_PZR4_P0                         *((volatile  uint8_t *)(0x42DEE200UL))
#define bFM_GPIO_PZR4_P1                          *((volatile  uint8_t *)(0x42DEE204UL))
#define bFM4_GPIO_PZR4_P1                         *((volatile  uint8_t *)(0x42DEE204UL))
#define bFM_GPIO_PZR4_P2                          *((volatile  uint8_t *)(0x42DEE208UL))
#define bFM4_GPIO_PZR4_P2                         *((volatile  uint8_t *)(0x42DEE208UL))
#define bFM_GPIO_PZR4_P3                          *((volatile  uint8_t *)(0x42DEE20CUL))
#define bFM4_GPIO_PZR4_P3                         *((volatile  uint8_t *)(0x42DEE20CUL))
#define bFM_GPIO_PZR4_P4                          *((volatile  uint8_t *)(0x42DEE210UL))
#define bFM4_GPIO_PZR4_P4                         *((volatile  uint8_t *)(0x42DEE210UL))
#define bFM_GPIO_PZR4_P5                          *((volatile  uint8_t *)(0x42DEE214UL))
#define bFM4_GPIO_PZR4_P5                         *((volatile  uint8_t *)(0x42DEE214UL))
#define bFM_GPIO_PZR4_P6                          *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P6                         *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile  uint8_t *)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P7                         *((volatile  uint8_t *)(0x42DEE21CUL))
#define bFM_GPIO_PZR4_P8                          *((volatile  uint8_t *)(0x42DEE220UL))
#define bFM4_GPIO_PZR4_P8                         *((volatile  uint8_t *)(0x42DEE220UL))
#define bFM_GPIO_PZR4_P9                          *((volatile  uint8_t *)(0x42DEE224UL))
#define bFM4_GPIO_PZR4_P9                         *((volatile  uint8_t *)(0x42DEE224UL))
#define bFM_GPIO_PZR4_PA                          *((volatile  uint8_t *)(0x42DEE228UL))
#define bFM4_GPIO_PZR4_PA                         *((volatile  uint8_t *)(0x42DEE228UL))
#define bFM_GPIO_PZR4_PB                          *((volatile  uint8_t *)(0x42DEE22CUL))
#define bFM4_GPIO_PZR4_PB                         *((volatile  uint8_t *)(0x42DEE22CUL))
#define bFM_GPIO_PZR4_PC                          *((volatile  uint8_t *)(0x42DEE230UL))
#define bFM4_GPIO_PZR4_PC                         *((volatile  uint8_t *)(0x42DEE230UL))
#define bFM_GPIO_PZR4_PD                          *((volatile  uint8_t *)(0x42DEE234UL))
#define bFM4_GPIO_PZR4_PD                         *((volatile  uint8_t *)(0x42DEE234UL))
#define bFM_GPIO_PZR4_PE                          *((volatile  uint8_t *)(0x42DEE238UL))
#define bFM4_GPIO_PZR4_PE                         *((volatile  uint8_t *)(0x42DEE238UL))

#define bFM_GPIO_PZR6_P0                          *((volatile  uint8_t *)(0x42DEE300UL))
#define bFM4_GPIO_PZR6_P0                         *((volatile  uint8_t *)(0x42DEE300UL))
#define bFM_GPIO_PZR6_P1                          *((volatile  uint8_t *)(0x42DEE304UL))
#define bFM4_GPIO_PZR6_P1                         *((volatile  uint8_t *)(0x42DEE304UL))
#define bFM_GPIO_PZR6_P2                          *((volatile  uint8_t *)(0x42DEE308UL))
#define bFM4_GPIO_PZR6_P2                         *((volatile  uint8_t *)(0x42DEE308UL))
#define bFM_GPIO_PZR6_P3                          *((volatile  uint8_t *)(0x42DEE30CUL))
#define bFM4_GPIO_PZR6_P3                         *((volatile  uint8_t *)(0x42DEE30CUL))
#define bFM_GPIO_PZR6_PE                          *((volatile  uint8_t *)(0x42DEE338UL))
#define bFM4_GPIO_PZR6_PE                         *((volatile  uint8_t *)(0x42DEE338UL))

#define bFM_GPIO_PZR7_P0                          *((volatile  uint8_t *)(0x42DEE380UL))
#define bFM4_GPIO_PZR7_P0                         *((volatile  uint8_t *)(0x42DEE380UL))
#define bFM_GPIO_PZR7_P1                          *((volatile  uint8_t *)(0x42DEE384UL))
#define bFM4_GPIO_PZR7_P1                         *((volatile  uint8_t *)(0x42DEE384UL))
#define bFM_GPIO_PZR7_P2                          *((volatile  uint8_t *)(0x42DEE388UL))
#define bFM4_GPIO_PZR7_P2                         *((volatile  uint8_t *)(0x42DEE388UL))
#define bFM_GPIO_PZR7_P3                          *((volatile  uint8_t *)(0x42DEE38CUL))
#define bFM4_GPIO_PZR7_P3                         *((volatile  uint8_t *)(0x42DEE38CUL))
#define bFM_GPIO_PZR7_P4                          *((volatile  uint8_t *)(0x42DEE390UL))
#define bFM4_GPIO_PZR7_P4                         *((volatile  uint8_t *)(0x42DEE390UL))
#define bFM_GPIO_PZR7_P5                          *((volatile  uint8_t *)(0x42DEE394UL))
#define bFM4_GPIO_PZR7_P5                         *((volatile  uint8_t *)(0x42DEE394UL))
#define bFM_GPIO_PZR7_P6                          *((volatile  uint8_t *)(0x42DEE398UL))
#define bFM4_GPIO_PZR7_P6                         *((volatile  uint8_t *)(0x42DEE398UL))
#define bFM_GPIO_PZR7_P7                          *((volatile  uint8_t *)(0x42DEE39CUL))
#define bFM4_GPIO_PZR7_P7                         *((volatile  uint8_t *)(0x42DEE39CUL))
#define bFM_GPIO_PZR7_P8                          *((volatile  uint8_t *)(0x42DEE3A0UL))
#define bFM4_GPIO_PZR7_P8                         *((volatile  uint8_t *)(0x42DEE3A0UL))
#define bFM_GPIO_PZR7_P9                          *((volatile  uint8_t *)(0x42DEE3A4UL))
#define bFM4_GPIO_PZR7_P9                         *((volatile  uint8_t *)(0x42DEE3A4UL))
#define bFM_GPIO_PZR7_PA                          *((volatile  uint8_t *)(0x42DEE3A8UL))
#define bFM4_GPIO_PZR7_PA                         *((volatile  uint8_t *)(0x42DEE3A8UL))

