mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
#define bFM_MFS8_LIN_SMR_SOE                      *((volatile  uint8_t *)(0x42710000UL))
#define bFM4_MFS8_LIN_SMR_SOE                     *((volatile  uint8_t *)(0x42710000UL))
#define bFM_MFS8_LIN_SMR_SBL                      *((volatile  uint8_t *)(0x4271000CUL))
#define bFM4_MFS8_LIN_SMR_SBL                     *((volatile  uint8_t *)(0x4271000CUL))
#define bFM_MFS8_LIN_SMR_WUCR                     *((volatile  uint8_t *)(0x42710010UL))
#define bFM4_MFS8_LIN_SMR_WUCR                    *((volatile  uint8_t *)(0x42710010UL))

#define bFM_MFS8_LIN_SSR_TBI                      *((volatile  uint8_t *)(0x427100A0UL))
#define bFM4_MFS8_LIN_SSR_TBI                     *((volatile  uint8_t *)(0x427100A0UL))
#define bFM_MFS8_LIN_SSR_TDRE                     *((volatile  uint8_t *)(0x427100A4UL))
#define bFM4_MFS8_LIN_SSR_TDRE                    *((volatile  uint8_t *)(0x427100A4UL))
#define bFM_MFS8_LIN_SSR_RDRF                     *((volatile  uint8_t *)(0x427100A8UL))
#define bFM4_MFS8_LIN_SSR_RDRF                    *((volatile  uint8_t *)(0x427100A8UL))
#define bFM_MFS8_LIN_SSR_ORE                      *((volatile  uint8_t *)(0x427100ACUL))
#define bFM4_MFS8_LIN_SSR_ORE                     *((volatile  uint8_t *)(0x427100ACUL))
#define bFM_MFS8_LIN_SSR_FRE                      *((volatile  uint8_t *)(0x427100B0UL))
#define bFM4_MFS8_LIN_SSR_FRE                     *((volatile  uint8_t *)(0x427100B0UL))
#define bFM_MFS8_LIN_SSR_LBD                      *((volatile  uint8_t *)(0x427100B4UL))
#define bFM4_MFS8_LIN_SSR_LBD                     *((volatile  uint8_t *)(0x427100B4UL))
#define bFM_MFS8_LIN_SSR_REC                      *((volatile  uint8_t *)(0x427100BCUL))
#define bFM4_MFS8_LIN_SSR_REC                     *((volatile  uint8_t *)(0x427100BCUL))

#define bFM_MFS8_UART_BGR_EXT                     *((volatile  uint8_t *)(0x427101BCUL))
#define bFM4_MFS8_UART_BGR_EXT                    *((volatile  uint8_t *)(0x427101BCUL))

#define bFM_MFS8_UART_ESCR_P                      *((volatile  uint8_t *)(0x4271008CUL))
#define bFM4_MFS8_UART_ESCR_P                     *((volatile  uint8_t *)(0x4271008CUL))
#define bFM_MFS8_UART_ESCR_PEN                    *((volatile  uint8_t *)(0x42710090UL))
#define bFM4_MFS8_UART_ESCR_PEN                   *((volatile  uint8_t *)(0x42710090UL))
#define bFM_MFS8_UART_ESCR_INV                    *((volatile  uint8_t *)(0x42710094UL))
#define bFM4_MFS8_UART_ESCR_INV                   *((volatile  uint8_t *)(0x42710094UL))
#define bFM_MFS8_UART_ESCR_ESBL                   *((volatile  uint8_t *)(0x42710098UL))
#define bFM4_MFS8_UART_ESCR_ESBL                  *((volatile  uint8_t *)(0x42710098UL))
#define bFM_MFS8_UART_ESCR_FLWEN                  *((volatile  uint8_t *)(0x4271009CUL))
#define bFM4_MFS8_UART_ESCR_FLWEN                 *((volatile  uint8_t *)(0x4271009CUL))

#define bFM_MFS8_UART_FCR_FE1                     *((volatile  uint8_t *)(0x42710280UL))
#define bFM4_MFS8_UART_FCR_FE1                    *((volatile  uint8_t *)(0x42710280UL))
#define bFM_MFS8_UART_FCR_FE2                     *((volatile  uint8_t *)(0x42710284UL))
#define bFM4_MFS8_UART_FCR_FE2                    *((volatile  uint8_t *)(0x42710284UL))
#define bFM_MFS8_UART_FCR_FCL1                    *((volatile  uint8_t *)(0x42710288UL))
#define bFM4_MFS8_UART_FCR_FCL1                   *((volatile  uint8_t *)(0x42710288UL))
#define bFM_MFS8_UART_FCR_FCL2                    *((volatile  uint8_t *)(0x4271028CUL))
#define bFM4_MFS8_UART_FCR_FCL2                   *((volatile  uint8_t *)(0x4271028CUL))
#define bFM_MFS8_UART_FCR_FSET                    *((volatile  uint8_t *)(0x42710290UL))
#define bFM4_MFS8_UART_FCR_FSET                   *((volatile  uint8_t *)(0x42710290UL))
#define bFM_MFS8_UART_FCR_FLD                     *((volatile  uint8_t *)(0x42710294UL))
#define bFM4_MFS8_UART_FCR_FLD                    *((volatile  uint8_t *)(0x42710294UL))
#define bFM_MFS8_UART_FCR_FLST                    *((volatile  uint8_t *)(0x42710298UL))
#define bFM4_MFS8_UART_FCR_FLST                   *((volatile  uint8_t *)(0x42710298UL))
#define bFM_MFS8_UART_FCR_FSEL                    *((volatile  uint8_t *)(0x427102A0UL))
#define bFM4_MFS8_UART_FCR_FSEL                   *((volatile  uint8_t *)(0x427102A0UL))
#define bFM_MFS8_UART_FCR_FTIE                    *((volatile  uint8_t *)(0x427102A4UL))
#define bFM4_MFS8_UART_FCR_FTIE                   *((volatile  uint8_t *)(0x427102A4UL))
#define bFM_MFS8_UART_FCR_FDRQ                    *((volatile  uint8_t *)(0x427102A8UL))
#define bFM4_MFS8_UART_FCR_FDRQ                   *((volatile  uint8_t *)(0x427102A8UL))
#define bFM_MFS8_UART_FCR_FRIIE                   *((volatile  uint8_t *)(0x427102ACUL))
#define bFM4_MFS8_UART_FCR_FRIIE                  *((volatile  uint8_t *)(0x427102ACUL))
#define bFM_MFS8_UART_FCR_FLSTE                   *((volatile  uint8_t *)(0x427102B0UL))
#define bFM4_MFS8_UART_FCR_FLSTE                  *((volatile  uint8_t *)(0x427102B0UL))

#define bFM_MFS8_UART_SCR_TXE                     *((volatile  uint8_t *)(0x42710020UL))
#define bFM4_MFS8_UART_SCR_TXE                    *((volatile  uint8_t *)(0x42710020UL))
#define bFM_MFS8_UART_SCR_RXE                     *((volatile  uint8_t *)(0x42710024UL))
#define bFM4_MFS8_UART_SCR_RXE                    *((volatile  uint8_t *)(0x42710024UL))
#define bFM_MFS8_UART_SCR_TBIE                    *((volatile  uint8_t *)(0x42710028UL))
#define bFM4_MFS8_UART_SCR_TBIE                   *((volatile  uint8_t *)(0x42710028UL))
#define bFM_MFS8_UART_SCR_TIE                     *((volatile  uint8_t *)(0x4271002CUL))
#define bFM4_MFS8_UART_SCR_TIE                    *((volatile  uint8_t *)(0x4271002CUL))
#define bFM_MFS8_UART_SCR_RIE                     *((volatile  uint8_t *)(0x42710030UL))
#define bFM4_MFS8_UART_SCR_RIE                    *((volatile  uint8_t *)(0x42710030UL))
#define bFM_MFS8_UART_SCR_UPCL                    *((volatile  uint8_t *)(0x4271003CUL))
#define bFM4_MFS8_UART_SCR_UPCL                   *((volatile  uint8_t *)(0x4271003CUL))

#define bFM_MFS8_UART_SMR_SOE                     *((volatile  uint8_t *)(0x42710000UL))
#define bFM4_MFS8_UART_SMR_SOE                    *((volatile  uint8_t *)(0x42710000UL))
#define bFM_MFS8_UART_SMR_BDS                     *((volatile  uint8_t *)(0x42710008UL))
#define bFM4_MFS8_UART_SMR_BDS                    *((volatile  uint8_t *)(0x42710008UL))
#define bFM_MFS8_UART_SMR_SBL                     *((volatile  uint8_t *)(0x4271000CUL))
#define bFM4_MFS8_UART_SMR_SBL                    *((volatile  uint8_t *)(0x4271000CUL))

#define bFM_MFS8_UART_SSR_TBI                     *((volatile  uint8_t *)(0x427100A0UL))
#define bFM4_MFS8_UART_SSR_TBI                    *((volatile  uint8_t *)(0x427100A0UL))
#define bFM_MFS8_UART_SSR_TDRE                    *((volatile  uint8_t *)(0x427100A4UL))
#define bFM4_MFS8_UART_SSR_TDRE                   *((volatile  uint8_t *)(0x427100A4UL))
#define bFM_MFS8_UART_SSR_RDRF                    *((volatile  uint8_t *)(0x427100A8UL))
#define bFM4_MFS8_UART_SSR_RDRF                   *((volatile  uint8_t *)(0x427100A8UL))
#define bFM_MFS8_UART_SSR_ORE                     *((volatile  uint8_t *)(0x427100ACUL))
#define bFM4_MFS8_UART_SSR_ORE                    *((volatile  uint8_t *)(0x427100ACUL))
#define bFM_MFS8_UART_SSR_FRE                     *((volatile  uint8_t *)(0x427100B0UL))
#define bFM4_MFS8_UART_SSR_FRE                    *((volatile  uint8_t *)(0x427100B0UL))
#define bFM_MFS8_UART_SSR_PE                      *((volatile  uint8_t *)(0x427100B4UL))
#define bFM4_MFS8_UART_SSR_PE                     *((volatile  uint8_t *)(0x427100B4UL))
#define bFM_MFS8_UART_SSR_REC                     *((volatile  uint8_t *)(0x427100BCUL))
#define bFM4_MFS8_UART_SSR_REC                    *((volatile  uint8_t *)(0x427100BCUL))


