mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
/*******************************************************************************
* QPRC Registers QPRC3
*   Bitband Section
*******************************************************************************/
#define bFM_QPRC3_QCR_PSTP                        *((volatile  uint8_t *)(0x424C1B10UL))
#define bFM4_QPRC3_QCR_PSTP                       *((volatile  uint8_t *)(0x424C1B10UL))
#define bFM_QPRC3_QCR_CGSC                        *((volatile  uint8_t *)(0x424C1B14UL))
#define bFM4_QPRC3_QCR_CGSC                       *((volatile  uint8_t *)(0x424C1B14UL))
#define bFM_QPRC3_QCR_RSEL                        *((volatile  uint8_t *)(0x424C1B18UL))
#define bFM4_QPRC3_QCR_RSEL                       *((volatile  uint8_t *)(0x424C1B18UL))
#define bFM_QPRC3_QCR_SWAP                        *((volatile  uint8_t *)(0x424C1B1CUL))
#define bFM4_QPRC3_QCR_SWAP                       *((volatile  uint8_t *)(0x424C1B1CUL))

#define bFM_QPRC3_QECR_ORNGMD                     *((volatile  uint8_t *)(0x424C1B80UL))
#define bFM4_QPRC3_QECR_ORNGMD                    *((volatile  uint8_t *)(0x424C1B80UL))
#define bFM_QPRC3_QECR_ORNGF                      *((volatile  uint8_t *)(0x424C1B84UL))
#define bFM4_QPRC3_QECR_ORNGF                     *((volatile  uint8_t *)(0x424C1B84UL))
#define bFM_QPRC3_QECR_ORNGIE                     *((volatile  uint8_t *)(0x424C1B88UL))
#define bFM4_QPRC3_QECR_ORNGIE                    *((volatile  uint8_t *)(0x424C1B88UL))
#define bFM_QPRC3_QECR_PEC                        *((volatile  uint8_t *)(0x424C1B8CUL))
#define bFM4_QPRC3_QECR_PEC                       *((volatile  uint8_t *)(0x424C1B8CUL))

#define bFM_QPRC3_QICRH_CDCIE                     *((volatile  uint8_t *)(0x424C1AA0UL))
#define bFM4_QPRC3_QICRH_CDCIE                    *((volatile  uint8_t *)(0x424C1AA0UL))
#define bFM_QPRC3_QICRH_CDCF                      *((volatile  uint8_t *)(0x424C1AA4UL))
#define bFM4_QPRC3_QICRH_CDCF                     *((volatile  uint8_t *)(0x424C1AA4UL))
#define bFM_QPRC3_QICRH_DIRPC                     *((volatile  uint8_t *)(0x424C1AA8UL))
#define bFM4_QPRC3_QICRH_DIRPC                    *((volatile  uint8_t *)(0x424C1AA8UL))
#define bFM_QPRC3_QICRH_DIROU                     *((volatile  uint8_t *)(0x424C1AACUL))
#define bFM4_QPRC3_QICRH_DIROU                    *((volatile  uint8_t *)(0x424C1AACUL))
#define bFM_QPRC3_QICRH_QPCNRCMIE                 *((volatile  uint8_t *)(0x424C1AB0UL))
#define bFM4_QPRC3_QICRH_QPCNRCMIE                *((volatile  uint8_t *)(0x424C1AB0UL))
#define bFM_QPRC3_QICRH_QPCNRCMF                  *((volatile  uint8_t *)(0x424C1AB4UL))
#define bFM4_QPRC3_QICRH_QPCNRCMF                 *((volatile  uint8_t *)(0x424C1AB4UL))

#define bFM_QPRC3_QICRL_QPCMIE                    *((volatile  uint8_t *)(0x424C1A80UL))
#define bFM4_QPRC3_QICRL_QPCMIE                   *((volatile  uint8_t *)(0x424C1A80UL))
#define bFM_QPRC3_QICRL_QPCMF                     *((volatile  uint8_t *)(0x424C1A84UL))
#define bFM4_QPRC3_QICRL_QPCMF                    *((volatile  uint8_t *)(0x424C1A84UL))
#define bFM_QPRC3_QICRL_QPRCMIE                   *((volatile  uint8_t *)(0x424C1A88UL))
#define bFM4_QPRC3_QICRL_QPRCMIE                  *((volatile  uint8_t *)(0x424C1A88UL))
#define bFM_QPRC3_QICRL_QPRCMF                    *((volatile  uint8_t *)(0x424C1A8CUL))
#define bFM4_QPRC3_QICRL_QPRCMF                   *((volatile  uint8_t *)(0x424C1A8CUL))
#define bFM_QPRC3_QICRL_OUZIE                     *((volatile  uint8_t *)(0x424C1A90UL))
#define bFM4_QPRC3_QICRL_OUZIE                    *((volatile  uint8_t *)(0x424C1A90UL))
#define bFM_QPRC3_QICRL_UFDF                      *((volatile  uint8_t *)(0x424C1A94UL))
#define bFM4_QPRC3_QICRL_UFDF                     *((volatile  uint8_t *)(0x424C1A94UL))
#define bFM_QPRC3_QICRL_OFDF                      *((volatile  uint8_t *)(0x424C1A98UL))
#define bFM4_QPRC3_QICRL_OFDF                     *((volatile  uint8_t *)(0x424C1A98UL))
#define bFM_QPRC3_QICRL_ZIIF                      *((volatile  uint8_t *)(0x424C1A9CUL))
#define bFM4_QPRC3_QICRL_ZIIF                     *((volatile  uint8_t *)(0x424C1A9CUL))


/*******************************************************************************
* QPRC_NF Registers QPRC3_NF
*   Bitband Section
*******************************************************************************/
#define bFM_QPRC3_NF_NFCTLA_AINLV                 *((volatile  uint8_t *)(0x424C2610UL))
#define bFM4_QPRC3_NF_NFCTLA_AINLV                *((volatile  uint8_t *)(0x424C2610UL))
#define bFM_QPRC3_NF_NFCTLA_AINMD                 *((volatile  uint8_t *)(0x424C2614UL))
#define bFM4_QPRC3_NF_NFCTLA_AINMD                *((volatile  uint8_t *)(0x424C2614UL))

#define bFM_QPRC3_NF_NFCTLB_BINLV                 *((volatile  uint8_t *)(0x424C2690UL))
#define bFM4_QPRC3_NF_NFCTLB_BINLV                *((volatile  uint8_t *)(0x424C2690UL))
#define bFM_QPRC3_NF_NFCTLB_BINMD                 *((volatile  uint8_t *)(0x424C2694UL))
#define bFM4_QPRC3_NF_NFCTLB_BINMD                *((volatile  uint8_t *)(0x424C2694UL))

#define bFM_QPRC3_NF_NFCTLZ_ZINLV                 *((volatile  uint8_t *)(0x424C2710UL))
#define bFM4_QPRC3_NF_NFCTLZ_ZINLV                *((volatile  uint8_t *)(0x424C2710UL))
#define bFM_QPRC3_NF_NFCTLZ_ZINMD                 *((volatile  uint8_t *)(0x424C2714UL))
#define bFM4_QPRC3_NF_NFCTLZ_ZINMD                *((volatile  uint8_t *)(0x424C2714UL))


/*******************************************************************************
* RTC Registers RTC
*   Bitband Section
*******************************************************************************/
#define bFM_RTC_ALMOR_TAMO0                       *((volatile  uint8_t *)(0x42760330UL))
#define bFM4_RTC_ALMOR_TAMO0                      *((volatile  uint8_t *)(0x42760330UL))

#define bFM_RTC_WTCALEN_WTCALEN                   *((volatile  uint8_t *)(0x427604C0UL))
#define bFM4_RTC_WTCALEN_WTCALEN                  *((volatile  uint8_t *)(0x427604C0UL))

#define bFM_RTC_WTCLKS_WTCLKS                     *((volatile  uint8_t *)(0x42760400UL))
#define bFM4_RTC_WTCLKS_WTCLKS                    *((volatile  uint8_t *)(0x42760400UL))

#define bFM_RTC_WTCOSEL_WTCOSEL                   *((volatile  uint8_t *)(0x42760600UL))
#define bFM4_RTC_WTCOSEL_WTCOSEL                  *((volatile  uint8_t *)(0x42760600UL))

#define bFM_RTC_WTCR1_ST                          *((volatile  uint8_t *)(0x42760000UL))
#define bFM4_RTC_WTCR1_ST                         *((volatile  uint8_t *)(0x42760000UL))
#define bFM_RTC_WTCR1_RUN                         *((volatile  uint8_t *)(0x42760008UL))
#define bFM4_RTC_WTCR1_RUN                        *((volatile  uint8_t *)(0x42760008UL))
#define bFM_RTC_WTCR1_SRST                        *((volatile  uint8_t *)(0x4276000CUL))
#define bFM4_RTC_WTCR1_SRST                       *((volatile  uint8_t *)(0x4276000CUL))
#define bFM_RTC_WTCR1_SCST                        *((volatile  uint8_t *)(0x42760010UL))
#define bFM4_RTC_WTCR1_SCST                       *((volatile  uint8_t *)(0x42760010UL))
#define bFM_RTC_WTCR1_SCRST                       *((volatile  uint8_t *)(0x42760014UL))
#define bFM4_RTC_WTCR1_SCRST                      *((volatile  uint8_t *)(0x42760014UL))
#define bFM_RTC_WTCR1_BUSY                        *((volatile  uint8_t *)(0x42760018UL))
#define bFM4_RTC_WTCR1_BUSY                       *((volatile  uint8_t *)(0x42760018UL))
#define bFM_RTC_WTCR1_MIEN                        *((volatile  uint8_t *)(0x42760020UL))
#define bFM4_RTC_WTCR1_MIEN                       *((volatile  uint8_t *)(0x42760020UL))
#define bFM_RTC_WTCR1_HEN                         *((volatile  uint8_t *)(0x42760024UL))
#define bFM4_RTC_WTCR1_HEN                        *((volatile  uint8_t *)(0x42760024UL))
#define bFM_RTC_WTCR1_DEN                         *((volatile  uint8_t *)(0x42760028UL))
#define bFM4_RTC_WTCR1_DEN                        *((volatile  uint8_t *)(0x42760028UL))
#define bFM_RTC_WTCR1_MOEN                        *((volatile  uint8_t *)(0x4276002CUL))
#define bFM4_RTC_WTCR1_MOEN                       *((volatile  uint8_t *)(0x4276002CUL))
#define bFM_RTC_WTCR1_YEN                         *((volatile  uint8_t *)(0x42760030UL))
#define bFM4_RTC_WTCR1_YEN                        *((volatile  uint8_t *)(0x42760030UL))
#define bFM_RTC_WTCR1_INTSSI                      *((volatile  uint8_t *)(0x42760040UL))
#define bFM4_RTC_WTCR1_INTSSI                     *((volatile  uint8_t *)(0x42760040UL))
#define bFM_RTC_WTCR1_INTSI                       *((volatile  uint8_t *)(0x42760044UL))
#define bFM4_RTC_WTCR1_INTSI                      *((volatile  uint8_t *)(0x42760044UL))
#define bFM_RTC_WTCR1_INTMI                       *((volatile  uint8_t *)(0x42760048UL))
#define bFM4_RTC_WTCR1_INTMI                      *((volatile  uint8_t *)(0x42760048UL))
#define bFM_RTC_WTCR1_INTHI                       *((volatile  uint8_t *)(0x4276004CUL))
#define bFM4_RTC_WTCR1_INTHI                      *((volatile  uint8_t *)(0x4276004CUL))
#define bFM_RTC_WTCR1_INTTMI                      *((volatile  uint8_t *)(0x42760050UL))
#define bFM4_RTC_WTCR1_INTTMI                     *((volatile  uint8_t *)(0x42760050UL))
#define bFM_RTC_WTCR1_INTALI                      *((volatile  uint8_t *)(0x42760054UL))
#define bFM4_RTC_WTCR1_INTALI                     *((volatile  uint8_t *)(0x42760054UL))
#define bFM_RTC_WTCR1_INTERI                      *((volatile  uint8_t *)(0x42760058UL))
#define bFM4_RTC_WTCR1_INTERI                     *((volatile  uint8_t *)(0x42760058UL))
#define bFM_RTC_WTCR1_INTCRI                      *((volatile  uint8_t *)(0x4276005CUL))
#define bFM4_RTC_WTCR1_INTCRI                     *((volatile  uint8_t *)(0x4276005CUL))
#define bFM_RTC_WTCR1_INTSSIE                     *((volatile  uint8_t *)(0x42760060UL))
#define bFM4_RTC_WTCR1_INTSSIE                    *((volatile  uint8_t *)(0x42760060UL))
#define bFM_RTC_WTCR1_INTSIE                      *((volatile  uint8_t *)(0x42760064UL))
#define bFM4_RTC_WTCR1_INTSIE                     *((volatile  uint8_t *)(0x42760064UL))
#define bFM_RTC_WTCR1_INTMIE                      *((volatile  uint8_t *)(0x42760068UL))
#define bFM4_RTC_WTCR1_INTMIE                     *((volatile  uint8_t *)(0x42760068UL))
#define bFM_RTC_WTCR1_INTHIE                      *((volatile  uint8_t *)(0x4276006CUL))
#define bFM4_RTC_WTCR1_INTHIE                     *((volatile  uint8_t *)(0x4276006CUL))
#define bFM_RTC_WTCR1_INTTMIE                     *((volatile  uint8_t *)(0x42760070UL))
#define bFM4_RTC_WTCR1_INTTMIE                    *((volatile  uint8_t *)(0x42760070UL))
#define bFM_RTC_WTCR1_INTALIE                     *((volatile  uint8_t *)(0x42760074UL))
#define bFM4_RTC_WTCR1_INTALIE                    *((volatile  uint8_t *)(0x42760074UL))
#define bFM_RTC_WTCR1_INTERIE                     *((volatile  uint8_t *)(0x42760078UL))
#define bFM4_RTC_WTCR1_INTERIE                    *((volatile  uint8_t *)(0x42760078UL))
#define bFM_RTC_WTCR1_INTCRIE                     *((volatile  uint8_t *)(0x4276007CUL))
#define bFM4_RTC_WTCR1_INTCRIE                    *((volatile  uint8_t *)(0x4276007CUL))

#define bFM_RTC_WTCR2_CREAD                       *((volatile  uint8_t *)(0x42760080UL))
#define bFM4_RTC_WTCR2_CREAD                      *((volatile  uint8_t *)(0x42760080UL))
#define bFM_RTC_WTCR2_TMST                        *((volatile  uint8_t *)(0x427600A0UL))
#define bFM4_RTC_WTCR2_TMST                       *((volatile  uint8_t *)(0x427600A0UL))
#define bFM_RTC_WTCR2_TMEN                        *((volatile  uint8_t *)(0x427600A4UL))
#define bFM4_RTC_WTCR2_TMEN                       *((volatile  uint8_t *)(0x427600A4UL))
#define bFM_RTC_WTCR2_TMRUN                       *((volatile  uint8_t *)(0x427600A8UL))
#define bFM4_RTC_WTCR2_TMRUN                      *((volatile  uint8_t *)(0x427600A8UL))

