mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
#define bFM_RTC_WTDIVEN_WTDIVEN                   *((volatile  uint8_t *)(0x42760520UL))
#define bFM4_RTC_WTDIVEN_WTDIVEN                  *((volatile  uint8_t *)(0x42760520UL))
#define bFM_RTC_WTDIVEN_WTDIVRDY                  *((volatile  uint8_t *)(0x42760524UL))
#define bFM4_RTC_WTDIVEN_WTDIVRDY                 *((volatile  uint8_t *)(0x42760524UL))

#define bFM_RTC_WTMOR_TMO0                        *((volatile  uint8_t *)(0x42760230UL))
#define bFM4_RTC_WTMOR_TMO0                       *((volatile  uint8_t *)(0x42760230UL))


/*******************************************************************************
* SBSSR Registers SBSSR
*   Bitband Section
*******************************************************************************/
#define bFM_SBSSR_BTSSSR_SSSR0                    *((volatile  uint8_t *)(0x424BFF80UL))
#define bFM4_SBSSR_BTSSSR_SSSR0                   *((volatile  uint8_t *)(0x424BFF80UL))
#define bFM_SBSSR_BTSSSR_SSSR1                    *((volatile  uint8_t *)(0x424BFF84UL))
#define bFM4_SBSSR_BTSSSR_SSSR1                   *((volatile  uint8_t *)(0x424BFF84UL))
#define bFM_SBSSR_BTSSSR_SSSR2                    *((volatile  uint8_t *)(0x424BFF88UL))
#define bFM4_SBSSR_BTSSSR_SSSR2                   *((volatile  uint8_t *)(0x424BFF88UL))
#define bFM_SBSSR_BTSSSR_SSSR3                    *((volatile  uint8_t *)(0x424BFF8CUL))
#define bFM4_SBSSR_BTSSSR_SSSR3                   *((volatile  uint8_t *)(0x424BFF8CUL))
#define bFM_SBSSR_BTSSSR_SSSR4                    *((volatile  uint8_t *)(0x424BFF90UL))
#define bFM4_SBSSR_BTSSSR_SSSR4                   *((volatile  uint8_t *)(0x424BFF90UL))
#define bFM_SBSSR_BTSSSR_SSSR5                    *((volatile  uint8_t *)(0x424BFF94UL))
#define bFM4_SBSSR_BTSSSR_SSSR5                   *((volatile  uint8_t *)(0x424BFF94UL))
#define bFM_SBSSR_BTSSSR_SSSR6                    *((volatile  uint8_t *)(0x424BFF98UL))
#define bFM4_SBSSR_BTSSSR_SSSR6                   *((volatile  uint8_t *)(0x424BFF98UL))
#define bFM_SBSSR_BTSSSR_SSSR7                    *((volatile  uint8_t *)(0x424BFF9CUL))
#define bFM4_SBSSR_BTSSSR_SSSR7                   *((volatile  uint8_t *)(0x424BFF9CUL))
#define bFM_SBSSR_BTSSSR_SSSR8                    *((volatile  uint8_t *)(0x424BFFA0UL))
#define bFM4_SBSSR_BTSSSR_SSSR8                   *((volatile  uint8_t *)(0x424BFFA0UL))
#define bFM_SBSSR_BTSSSR_SSSR9                    *((volatile  uint8_t *)(0x424BFFA4UL))
#define bFM4_SBSSR_BTSSSR_SSSR9                   *((volatile  uint8_t *)(0x424BFFA4UL))
#define bFM_SBSSR_BTSSSR_SSSR10                   *((volatile  uint8_t *)(0x424BFFA8UL))
#define bFM4_SBSSR_BTSSSR_SSSR10                  *((volatile  uint8_t *)(0x424BFFA8UL))
#define bFM_SBSSR_BTSSSR_SSSR11                   *((volatile  uint8_t *)(0x424BFFACUL))
#define bFM4_SBSSR_BTSSSR_SSSR11                  *((volatile  uint8_t *)(0x424BFFACUL))
#define bFM_SBSSR_BTSSSR_SSSR12                   *((volatile  uint8_t *)(0x424BFFB0UL))
#define bFM4_SBSSR_BTSSSR_SSSR12                  *((volatile  uint8_t *)(0x424BFFB0UL))
#define bFM_SBSSR_BTSSSR_SSSR13                   *((volatile  uint8_t *)(0x424BFFB4UL))
#define bFM4_SBSSR_BTSSSR_SSSR13                  *((volatile  uint8_t *)(0x424BFFB4UL))
#define bFM_SBSSR_BTSSSR_SSSR14                   *((volatile  uint8_t *)(0x424BFFB8UL))
#define bFM4_SBSSR_BTSSSR_SSSR14                  *((volatile  uint8_t *)(0x424BFFB8UL))
#define bFM_SBSSR_BTSSSR_SSSR15                   *((volatile  uint8_t *)(0x424BFFBCUL))
#define bFM4_SBSSR_BTSSSR_SSSR15                  *((volatile  uint8_t *)(0x424BFFBCUL))


/*******************************************************************************
* SMCIF Registers SMCIF0
*   Bitband Section
*******************************************************************************/
#define bFM_SMCIF0_BAUDRATE_LITTLESTEP            *((volatile  uint16_t*)(0x427922BCUL))
#define bFM4_SMCIF0_BAUDRATE_LITTLESTEP           *((volatile  uint16_t*)(0x427922BCUL))

#define bFM_SMCIF0_FIFO_CLEAR_MSB_READ_CLRRDFIFO  *((volatile  uint16_t*)(0x42792700UL))
#define bFM4_SMCIF0_FIFO_CLEAR_MSB_READ_CLRRDFIFO *((volatile  uint16_t*)(0x42792700UL))

#define bFM_SMCIF0_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42792680UL))
#define bFM4_SMCIF0_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42792680UL))

#define bFM_SMCIF0_FIFO_MODE_FIFOEN               *((volatile  uint16_t*)(0x42792600UL))
#define bFM4_SMCIF0_FIFO_MODE_FIFOEN              *((volatile  uint16_t*)(0x42792600UL))
#define bFM_SMCIF0_FIFO_MODE_RDFIFOOVRIRQEN       *((volatile  uint16_t*)(0x42792604UL))
#define bFM4_SMCIF0_FIFO_MODE_RDFIFOOVRIRQEN      *((volatile  uint16_t*)(0x42792604UL))
#define bFM_SMCIF0_FIFO_MODE_WRFIFOIRQEN          *((volatile  uint16_t*)(0x42792608UL))
#define bFM4_SMCIF0_FIFO_MODE_WRFIFOIRQEN         *((volatile  uint16_t*)(0x42792608UL))
#define bFM_SMCIF0_FIFO_MODE_RDFIFOIRQEN          *((volatile  uint16_t*)(0x4279260CUL))
#define bFM4_SMCIF0_FIFO_MODE_RDFIFOIRQEN         *((volatile  uint16_t*)(0x4279260CUL))

#define bFM_SMCIF0_GLOBALCONTROL1_PARITY          *((volatile  uint16_t*)(0x42792000UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_PARITY         *((volatile  uint16_t*)(0x42792000UL))
#define bFM_SMCIF0_GLOBALCONTROL1_FRM0            *((volatile  uint16_t*)(0x42792004UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_FRM0           *((volatile  uint16_t*)(0x42792004UL))
#define bFM_SMCIF0_GLOBALCONTROL1_FRM1            *((volatile  uint16_t*)(0x42792008UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_FRM1           *((volatile  uint16_t*)(0x42792008UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MODE8N1         *((volatile  uint16_t*)(0x4279200CUL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MODE8N1        *((volatile  uint16_t*)(0x4279200CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKRXFUL       *((volatile  uint16_t*)(0x42792010UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKRXFUL      *((volatile  uint16_t*)(0x42792010UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKTXEMP       *((volatile  uint16_t*)(0x42792014UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKTXEMP      *((volatile  uint16_t*)(0x42792014UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKSTI         *((volatile  uint16_t*)(0x42792018UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKSTI        *((volatile  uint16_t*)(0x42792018UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKCAEVENT     *((volatile  uint16_t*)(0x4279201CUL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKCAEVENT    *((volatile  uint16_t*)(0x4279201CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKITEXP       *((volatile  uint16_t*)(0x42792020UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKITEXP      *((volatile  uint16_t*)(0x42792020UL))
#define bFM_SMCIF0_GLOBALCONTROL1_IOMOD           *((volatile  uint16_t*)(0x42792024UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_IOMOD          *((volatile  uint16_t*)(0x42792024UL))
#define bFM_SMCIF0_GLOBALCONTROL1_CKMOD           *((volatile  uint16_t*)(0x42792028UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_CKMOD          *((volatile  uint16_t*)(0x42792028UL))
#define bFM_SMCIF0_GLOBALCONTROL1_RESND           *((volatile  uint16_t*)(0x4279202CUL))
#define bFM4_SMCIF0_GLOBALCONTROL1_RESND          *((volatile  uint16_t*)(0x4279202CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_GUAEN           *((volatile  uint16_t*)(0x42792030UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_GUAEN          *((volatile  uint16_t*)(0x42792030UL))
#define bFM_SMCIF0_GLOBALCONTROL1_STIDT           *((volatile  uint16_t*)(0x42792034UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_STIDT          *((volatile  uint16_t*)(0x42792034UL))
#define bFM_SMCIF0_GLOBALCONTROL1_IDTSC           *((volatile  uint16_t*)(0x42792038UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_IDTSC          *((volatile  uint16_t*)(0x42792038UL))

#define bFM_SMCIF0_GLOBALCONTROL2_RX8N1           *((volatile  uint16_t*)(0x42792400UL))
#define bFM4_SMCIF0_GLOBALCONTROL2_RX8N1          *((volatile  uint16_t*)(0x42792400UL))
#define bFM_SMCIF0_GLOBALCONTROL2_INVDATAOUT      *((volatile  uint16_t*)(0x42792404UL))
#define bFM4_SMCIF0_GLOBALCONTROL2_INVDATAOUT     *((volatile  uint16_t*)(0x42792404UL))
#define bFM_SMCIF0_GLOBALCONTROL2_ICCDISABLE      *((volatile  uint16_t*)(0x4279240CUL))
#define bFM4_SMCIF0_GLOBALCONTROL2_ICCDISABLE     *((volatile  uint16_t*)(0x4279240CUL))

