mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2g3xh/common/s6e2g3xh.h
#define bFM_USB1_UDCIE_CONFIE                     *((volatile  uint8_t *)(0x42A84820UL))
#define bFM4_USB1_UDCIE_CONFIE                    *((volatile  uint8_t *)(0x42A84820UL))
#define bFM_USB1_UDCIE_CONFN                      *((volatile  uint8_t *)(0x42A84824UL))
#define bFM4_USB1_UDCIE_CONFN                     *((volatile  uint8_t *)(0x42A84824UL))
#define bFM_USB1_UDCIE_WKUPIE                     *((volatile  uint8_t *)(0x42A84828UL))
#define bFM4_USB1_UDCIE_WKUPIE                    *((volatile  uint8_t *)(0x42A84828UL))
#define bFM_USB1_UDCIE_BRSTIE                     *((volatile  uint8_t *)(0x42A8482CUL))
#define bFM4_USB1_UDCIE_BRSTIE                    *((volatile  uint8_t *)(0x42A8482CUL))
#define bFM_USB1_UDCIE_SOFIE                      *((volatile  uint8_t *)(0x42A84830UL))
#define bFM4_USB1_UDCIE_SOFIE                     *((volatile  uint8_t *)(0x42A84830UL))
#define bFM_USB1_UDCIE_SUSPIE                     *((volatile  uint8_t *)(0x42A84834UL))
#define bFM4_USB1_UDCIE_SUSPIE                    *((volatile  uint8_t *)(0x42A84834UL))

#define bFM_USB1_UDCS_CONF                        *((volatile  uint8_t *)(0x42A84800UL))
#define bFM4_USB1_UDCS_CONF                       *((volatile  uint8_t *)(0x42A84800UL))
#define bFM_USB1_UDCS_SETP                        *((volatile  uint8_t *)(0x42A84804UL))
#define bFM4_USB1_UDCS_SETP                       *((volatile  uint8_t *)(0x42A84804UL))
#define bFM_USB1_UDCS_WKUP                        *((volatile  uint8_t *)(0x42A84808UL))
#define bFM4_USB1_UDCS_WKUP                       *((volatile  uint8_t *)(0x42A84808UL))
#define bFM_USB1_UDCS_BRST                        *((volatile  uint8_t *)(0x42A8480CUL))
#define bFM4_USB1_UDCS_BRST                       *((volatile  uint8_t *)(0x42A8480CUL))
#define bFM_USB1_UDCS_SOF                         *((volatile  uint8_t *)(0x42A84810UL))
#define bFM4_USB1_UDCS_SOF                        *((volatile  uint8_t *)(0x42A84810UL))
#define bFM_USB1_UDCS_SUSP                        *((volatile  uint8_t *)(0x42A84814UL))
#define bFM4_USB1_UDCS_SUSP                       *((volatile  uint8_t *)(0x42A84814UL))


/*******************************************************************************
* USBCLK Registers USBCLK
*   Bitband Section
*******************************************************************************/
#define bFM_USBCLK_UCCR_UCEN0                     *((volatile  uint8_t *)(0x426C0000UL))
#define bFM4_USBCLK_UCCR_UCEN0                    *((volatile  uint8_t *)(0x426C0000UL))
#define bFM_USBCLK_UCCR_UCSEL                     *((volatile  uint8_t *)(0x426C0004UL))
#define bFM4_USBCLK_UCCR_UCSEL                    *((volatile  uint8_t *)(0x426C0004UL))
#define bFM_USBCLK_UCCR_UCEN1                     *((volatile  uint8_t *)(0x426C000CUL))
#define bFM4_USBCLK_UCCR_UCEN1                    *((volatile  uint8_t *)(0x426C000CUL))

#define bFM_USBCLK_UP_STR_UPRDY                   *((volatile  uint8_t *)(0x426C0280UL))
#define bFM4_USBCLK_UP_STR_UPRDY                  *((volatile  uint8_t *)(0x426C0280UL))

#define bFM_USBCLK_UPCR1_UPLLEN                   *((volatile  uint8_t *)(0x426C0080UL))
#define bFM4_USBCLK_UPCR1_UPLLEN                  *((volatile  uint8_t *)(0x426C0080UL))
#define bFM_USBCLK_UPCR1_UPINC                    *((volatile  uint8_t *)(0x426C0084UL))
#define bFM4_USBCLK_UPCR1_UPINC                   *((volatile  uint8_t *)(0x426C0084UL))

#define bFM_USBCLK_UPINT_CLR_UPCSC                *((volatile  uint8_t *)(0x426C0380UL))
#define bFM4_USBCLK_UPINT_CLR_UPCSC               *((volatile  uint8_t *)(0x426C0380UL))

#define bFM_USBCLK_UPINT_ENR_UPCSE                *((volatile  uint8_t *)(0x426C0300UL))
#define bFM4_USBCLK_UPINT_ENR_UPCSE               *((volatile  uint8_t *)(0x426C0300UL))

#define bFM_USBCLK_UPINT_STR_UPCSI                *((volatile  uint8_t *)(0x426C0400UL))
#define bFM4_USBCLK_UPINT_STR_UPCSI               *((volatile  uint8_t *)(0x426C0400UL))

#define bFM_USBCLK_USBEN0_USBEN0                  *((volatile  uint8_t *)(0x426C0600UL))
#define bFM4_USBCLK_USBEN0_USBEN0                 *((volatile  uint8_t *)(0x426C0600UL))

#define bFM_USBCLK_USBEN1_USBEN1                  *((volatile  uint8_t *)(0x426C0680UL))
#define bFM4_USBCLK_USBEN1_USBEN1                 *((volatile  uint8_t *)(0x426C0680UL))


/*******************************************************************************
* WC Registers WC
*   Bitband Section
*******************************************************************************/
#define bFM_WC_CLK_EN_CLK_EN                      *((volatile  uint8_t *)(0x42740280UL))
#define bFM4_WC_CLK_EN_CLK_EN                     *((volatile  uint8_t *)(0x42740280UL))
#define bFM_WC_CLK_EN_CLK_EN_R                    *((volatile  uint8_t *)(0x42740284UL))
#define bFM4_WC_CLK_EN_CLK_EN_R                   *((volatile  uint8_t *)(0x42740284UL))

#define bFM_WC_WCCR_WCIF                          *((volatile  uint8_t *)(0x42740040UL))
#define bFM4_WC_WCCR_WCIF                         *((volatile  uint8_t *)(0x42740040UL))
#define bFM_WC_WCCR_WCIE                          *((volatile  uint8_t *)(0x42740044UL))
#define bFM4_WC_WCCR_WCIE                         *((volatile  uint8_t *)(0x42740044UL))
#define bFM_WC_WCCR_WCOP                          *((volatile  uint8_t *)(0x42740058UL))
#define bFM4_WC_WCCR_WCOP                         *((volatile  uint8_t *)(0x42740058UL))
#define bFM_WC_WCCR_WCEN                          *((volatile  uint8_t *)(0x4274005CUL))
#define bFM4_WC_WCCR_WCEN                         *((volatile  uint8_t *)(0x4274005CUL))


#if defined __cplusplus
}
#endif

#endif /* _S6E2G3XH_H_ */
